flow-examples/class7/requestInsert.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:dat="http://ws.wso2.org/dataservice">
   <soap:Header/>
   <soap:Body>
   	<dat:mockInsert>
         <dat:nome>fulano4</dat:nome>
         <dat:telefone>444444</dat:telefone>
         <dat:cidade>Lisboa4</dat:cidade>
         <dat:pais>Portugal4</dat:pais>
     </dat:mockInsert>
    </soap:Body>
</soap:Envelope>